<img src="../Img/Python_SQL_PI.png" style="width:100%">


<p style="font-size:22px;text-align:center">Семинар 4.2. Подзапросы</p> 

<a id = Home></a>

24 марта 2022 года, чт<br>
Поток: ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (2 подгруппа)<br>


28 марта 2022 года, пн<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (3 подгруппа)<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (4 подгруппа)<br>

31 марта 2022 года, чт<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (1 подгруппа)


```
STUDENT
STUDENT_ID — числовой код, идентифицирующий студента (идентификатор студента),
SURNAME — фамилия студента,
NAME — имя студента,
STIPEND — стипендия, которую получает студент,
KURS — курс, на котором учится студент,
CITY — город, в котором живет студент,
BIRTHDAY — дата рождения студента,
UNIV_ID — идентификатор университета, в котором учится студент.


LECTURER
LECTURER_ID — идентификатор преподавателя,
SURNAME — фамилия преподавателя,
NAME — имя преподавателя,
CITY — город, в котором живет преподаватель,
UNIV_ID — идентификатор университета, в котором работает преподаватель


SUBJECT
SUBJ_ID — идентификатор предмета обучения,
SUBJ_NAME — наименование предмета обучения,
HOUR — количество часов, отводимых на изучение предмета,
SEMESTER — семестр, в котором изучается данный предмет.


UNIVERSITY
UNIV_ID — идентификатор университета,
UNIV_NAME — название университета,
RATING — рейтинг университета,
CITY — город, в котором расположен университет.


EXAM_MARKS
EXAM_ID — идентификатор экзамена,
STUDENT_ID — идентификатор студента,
SUBJ_ID — идентификатор предмета обучения,
MARK — экзаменационная оценка,
EXAM_DATE — дата экзамена.


SUBJ_LECT
LECTURER_ID — идентификатор преподавателя,
SUBJ_ID — идентификатор предмета обучения.
```

<img src="../Img/Students_Schema.png" style="width:60%">

<img src=../Img/pencil.png style="width:190px;height:190px">
<p style="background-color:powderblue; font-size:125%; color: rebeccapurple;">Выполните задания</p>
<p>Выполните задания в Jupyter Notebook на тему "Связанные подзапросы"</p>

1. Напишите запрос для получения списка студентов, которые учатся в своем городе.
2. Напишите запрос для получения списка иногородних студентов (обучающихся не в своем городе), с последующей сортировкой по идентификаторам университетов и курсам.
3. Напишите запрос для получения списка преподавателей, работающих не в своем городе, с последующей сортировкой по идентификаторам университетов и городам проживания преподавателей.
4. Напишите запрос для получения списка предметов, на изучение которых отведено максимальное количество часов среди всех предметов, изучаемых в том же семестре. Список упорядочить по семестрам.
5. Напишите запрос для получения списка студентов, получающих стипендию, превосходящую среднее значение стипендии на их курсе.
6. Напишите запрос для получения списка студентов, получающих минимальную стипендию в своем университете, с последующей сортировкой по значениям идентификатора университета и стипендии.
7. Напишите запрос для получения списка университетов, в которых учится более 50 студентов, с последующей сортировкой по рейтингам.
8. Напишите запрос для получения списка университетов, в которых работает более 5 преподавателей, с последующей сортировкой по рейтингам университетов.
9. Напишите запрос для получения списка отличников (студентов, получивших только отличные оценки), с последующей сортировкой по идентификаторам университетов и курсам.
10. Напишите запрос для получения списка неуспевающих студентов (получивших хотя бы одну неудовлетворительную оценку), с последующей сортировкой по идентификаторам университетов и курсам.

<p style="background-color:powderblue; font-size:125%; color: rebeccapurple;">Выполните задания</p>
<p>Выполните задания в Jupyter Notebook на тему "Связанные подзапросы в Having".</p>

1. Напишите команду SELECT, использующую связанные подзапросы и выполняющую вывод имен и идентификаторов студентов, у которых стипендия совпадает с максимальным значением стипендии для города, в котором живет студент.
6. Напишите запрос, который позволяет вывести имена и идентификаторы всех студентов, о которых точно известно, что они проживают в городе, где нет ни одного университета.
7. Напишите два запроса, которые позволяют вывести имена и идентификаторы всех студентов, о которых точно известно, что они проживают не в том городе, где расположен их университет: один запрос с использованием связанного подзапроса, а другой с использованием соединения.

<p style="background-color:powderblue; font-size:125%; color: rebeccapurple;">Выполните задания</p>
<p>Выполните задания в Jupyter Notebook на тему "Использование оператора EXISTS".</p>

1. Напишите запрос с EXISTS, позволяющий вывести данные обо всех студентах обучающихся в вузах, имеющих рейтинг выше 300.

2. Напишите предыдущий запрос, используя соединения.

3. Напишите запрос с EXISTS, выбирающий сведения о каждом студенте, для которого в городе его проживания имеется хотя бы один университет, в котором он не учится.

4. Напишите запрос, выбирающий из таблицы SUBJECT данные о названиях предметов обучения, экзамены по которым сданы более чем одним студентом.

5. Напишите запрос для получения списка городов проживания студентов, в которых есть хотя бы один университет.

In [1]:
#! pip install sqlalchemy

In [64]:
import pandas as pd
from sqlalchemy import MetaData, Table, create_engine, select, and_, or_, not_, exists
from sqlalchemy.sql import func

In [7]:
engine = create_engine('sqlite:///../Data/Students.db')
metadata_obj = MetaData() # Объект-контейнер, содержит информацию о схеме данных
metadata_obj.reflect(bind=engine) # Отображение БД
# Вызов метода reflect() приводит к включению в объект metadata_obj словаря всех таблиц БД.
conn=engine.connect() # Соединение

In [8]:
# Таблицы в БД
metadata_obj.tables.keys()

dict_keys(['city', 'exam_marks', 'student', 'university', 'subject', 'lecturer', 'subj_lect'])

Создание объектов таблиц

In [9]:
exam_marks=Table("exam_marks", metadata_obj, autoload=True, autoload_with="engine")
lecturer=Table("lecturer", metadata_obj, autoload=True, autoload_with="engine")
student=Table("student", metadata_obj, autoload=True, autoload_with="engine")
subj_lect=Table("subj_lect", metadata_obj, autoload=True, autoload_with="engine")
subject=Table("subject", metadata_obj, autoload=True, autoload_with="engine")
university=Table("university", metadata_obj, autolad=True, autolad_with="engine")

# Решение

In [10]:
# Ваш код здесь

#1 Напишите запрос для получения списка студентов, которые учатся в своем городе.
# SQL -

subq = select(university.c.city)
subq = subq.where(university.c.univ_id == student.c.univ_id).scalar_subquery()

s = select(student.c.surname, student.c.name, student.c.city)
s = s.where(student.c.city == subq)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, student.name, student.city
FROM student
WHERE student.city = (SELECT university.city
FROM university
WHERE university.univ_id = student.univ_id)

     surname       name         city
0    Сидоров      Вадим       Москва
1      Котов      Павел     Белгород
2     Белкин      Вадим      Воронеж
3  Журавлева       Вера  Новосибирск
4    Баранов  Александр       Москва
5    Петрова  Екатерина     Белгород
6   Миронова      Федор       Москва
7     Павлов     Андрей      Воронеж
8      Лукин      Артем      Воронеж

In [15]:
# 2 Напишите запрос для получения списка иногородних студентов (обучающихся не в своем городе), с последующей сортировкой по идентификаторам университетов и курсам.
# SQL -
sq = select(university.c.city)
sub_query = sq.where(student.c.univ_id == university.c.univ_id).scalar_subquery()

s = select(student)
s = s.where(student.c.city != sub_query).scalar_subquery()
s = s.order_by(student.c.univ_id)

print(s)
pd.read_sql(s, conn)[:10]

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.city != (SELECT university.city
FROM university
WHERE student.univ_id = university.univ_id) ORDER BY student.univ_id

,student_id,surname,name,stipend,kurs,city,birthday,univ_id
0,1,Иванов,Иван,150,1,Орел,2002-12-03,10
1,3,Петров,Петр,200,3,Курск,2000-12-01,10
2,10,Кузнецов,Борис,0,2,Брянск,2001-12-08,10
3,12,Зайцева,Ольга,250,2,Липецк,2001-05-01,10
4,62,Семенова,Вероника,0,3,Вологда,2003-10-04,10
5,66,Некрасова,Вероника,250,2,Иркутск,2004-08-23,10
6,76,Мельникова,Дарья,100,5,Архангельск,2002-08-01,10
7,78,Агафонов,Василий,150,1,Грозный,1994-10-29,10
8,88,Жданова,Ирина,200,3,Тверь,2002-03-02,10
9,99,Борисова,Марина,150,1,Рославль,1995-08-07,10

In [18]:
# 3 Напишите запрос для получения списка преподавателей, работающих не в своем городе, с последующей сортировкой по идентификаторам университетов и городам проживания преподавателей.

# SQL - SELECT * FROM lecturer WHERE city != (SELECT city FROM university WHERE lecturer.univ_id == university.univ_id)

sq = select(lecturer)
sub_query = select(university.c.city).where(lecturer.c.univ_id == university.c.univ_id).scalar_subquery()
s = sq.where(lecturer.c.city != sub_query)

print(s)
print(f"Кол-во записей удовлетворяющих условию: {len(pd.read_sql(s, conn))}")
pd.read_sql(s, conn)

SELECT lecturer.lecturer_id, lecturer.surname, lecturer.name, lecturer.city, lecturer.univ_id
FROM lecturer
WHERE lecturer.city != (SELECT university.city
FROM university
WHERE lecturer.univ_id = university.univ_id)
Кол-во записей удовлетворяющих условию: 24

    lecturer_id     surname       name                  city  univ_id
0             1    Сафонова      Лукия              Смоленск       46
1             2     Зайцева       Юлия              Белгород       10
2             3   Мамонтова    Акулина        Троицк (Моск.)       11
3             4   Богданова     Оксана            Всеволожск       18
4             5     Брагина     Нинель                  Кижи       48
5             6   Максимова     Иванна           Сковородино       10
6             7   Дмитриева     Оксана                 Шарья       48
7             8   Ситникова   Светлана             Сорочинск       18
8             9     Крюкова    Людмила                 Анива       18
9            10   Артемьева       Майя                 Курск       18
10           11    Куликова     Ираида         Городовиковск       47
11           12  Кудрявцева       Анна               Петушки       47
12           13      Зыкова     Оксана                 Калач       10
13           14    Стрелков     Руслан               Королев       46
14           15    Дорофеев   Прокофий       Санкт-Петербург       32
15           16      Волков     Михаил               Черусти       45
16           17     Сафонов    Будимир                Киржач       18
17           18       Зимин      Юлиан               Черский       46
18           19    Алексеев     Елисей                Мценск       10
19           20     Тихонов    Ладомир  Кропоткин (Краснод.)       15
20           21     Елисеев  Виссарион            Курганинск       48
21           22    Беспалов      Юлиан               Рыбинск       15
22           23     Беляков    Мефодий              Рославль       32
23          328     Сорокин     Андрей                  Орел       10

In [30]:
# 4. Напишите запрос для получения списка предметов, на изучение которых отведено максимальное количество часов среди всех предметов, изучаемых в том же семестре. Список упорядочить по семестрам.
# SQL - SELECT * FROM
subject_1 = subject.alias("subject_1")
subject_2 = subject.alias("subject_2")

sub_query = select(func.max(subject_2.c.hour))
sub_query = sub_query.where(subject_2.c.semester == subject_1.c.semester).scalar_subquery()

s = select(subject_1)
s = s.where(subject_1.c.hour == sub_query)
s = s.order_by(subject_1.c.semester)

print(s)
pd.read_sql(s, conn)

SELECT subject_1.subj_id, subject_1.subj_name, subject_1.hour, subject_1.semester
FROM subject AS subject_1
WHERE subject_1.hour = (SELECT max(subject_2.hour) AS max_1
FROM subject AS subject_2
WHERE subject_2.semester = subject_1.semester) ORDER BY subject_1.semester

   subj_id                                        subj_name  hour  semester
0       10                                      Информатика    56         1
1       43                                       Математика    56         2
2       94                                  Английский язык    56         3
3       23  Теория вероятностей и математическая статистика    72         4
4       73                                      Физкультура    34         5

In [35]:
# 5. Напишите запрос для получения списка студентов, получающих стипендию, превосходящую среднее значение стипендии на их курсе.
# SQL - SELECT * from student WHERE stipend > (SELECT avg(stipend) FROM student GROUP BY kurs)

student_1 = student.alias("student_1")
student_2 = student.alias("student_2")

sq = select(student_1)
sub_query = select(func.avg(student_2.c.stipend)).where(student_2.c.kurs == student_1.c.kurs).scalar_subquery()

s = sq.where(student_1.c.stipend > sub_query)

print(s)
pd.read_sql(s, conn)

SELECT student_1.student_id, student_1.surname, student_1.name, student_1.stipend, student_1.kurs, student_1.city, student_1.birthday, student_1.univ_id
FROM student AS student_1
WHERE student_1.stipend > (SELECT avg(student_2.stipend) AS avg_1
FROM student AS student_2
WHERE student_2.kurs = student_1.kurs)

,student_id,surname,name,stipend,kurs,city,birthday,univ_id
0,1,Иванов,Иван,150,1,Орел,2002-12-03,10
1,3,Петров,Петр,200,3,Курск,2000-12-01,10
2,6,Сидоров,Вадим,150,4,Москва,1999-06-07,22
3,12,Зайцева,Ольга,250,2,Липецк,2001-05-01,10
4,55,Белкин,Вадим,250,5,Воронеж,2000-01-07,10
5,64,Жук,Оксана,250,1,Воркута,2000-11-16,47
6,66,Некрасова,Вероника,250,2,Иркутск,2004-08-23,10
7,68,Казакова,Ольга,250,4,Кемерово,2000-03-29,44
8,70,Миронова,Анна,200,2,Владикавказ,2000-10-08,46
9,71,Кондрат,Синицин,200,4,Ишим,2001-02-23,18
10,72,Пономарева,Алина,250,2,Ангарск,2002-10-07,48
11,78,Агафонов,Василий,150,1,Грозный,1994-10-29,10
12,82,Лапина,Элеонора,150,3,Джубга,1997-11-23,45
13,83,Сорокина,Ирина,200,3,Усмань,1993-09-28,48
14,85,Казакова,Мария,150,4,Нальчик,1994-02-18,32
15,86,Жукова,Фекла,150,3,Магадан,1998-10-06,46
16,88,Жданова,Ирина,200,3,Тверь,2002-03-02,10
17,89,Валерия,Овчинникова,200,5,Улан-Удэ,2000-06-15,18
18,91,Блохина,Ираида,250,3,Новый Уренгой,1997-03-23,22
19,92,Мельникова,Светлана,250,4,Кропоткин (Краснод.),1998-03-24,15
20,95,Сорокина,Валерия,150,1,Енисейск,1995-03-01,45
21,96,Тимофеева,Фаина,150,3,None,1999-08-01,45
22,97,Вишнякова,Анжела,200,2,Иваново,2002-02-10,46
23,99,Борисова,Марина,150,1,Рославль,1995-08-07,10
24,101,Калашников,Евгений,200,2,Калининград,1998-02-27,48
25,103,Трофимов,Владислав,250,5,Верхоянск,1995-03-24,11
26,107,Морозов,Кирилл,250,2,Кропоткин (Краснод.),2000-09-29,44
27,108,Назаров,Икром,150,4,Саянск,2001-12-15,47
28,110,Суханов,Константин,250,3,Курск,1996-11-22,14
29,112,Захаров,Софон,150,3,Мурманск,1994-03-19,46
30,113,Аксенов,Валерий,150,1,Мурманск,1994-10-27,10
31,114,Панов,Арсений,250,1,Геленджик,1996-12-23,32
32,118,Кондратьев,Николай,150,3,Ханты-Мансийск,1999-10-28,14
33,123,Веселов,Тимур,150,1,Невинномысск,1998-04-28,11
34,125,Пономарев,Варфоромей,200,4,Улан-Удэ,2000-12-15,44
35,130,Кудряшов,Роман,250,4,Нижний Новгород,1997-08-26,32
36,131,Ковалев,Ефим,200,2,Волгоград,1995-11-28,47
37,133,Жуковский,Юрий,150,4,Сургут (Хант.),1996-05-30,22
38,136,Ефимов,Яков,200,1,Тимашевск,2000-09-23,32
39,137,Кулаков,Феофан,150,3,Волоколамск,2001-03-14,46
40,139,Журавлев,Фома,200,2,Улан-Удэ,1997-07-12,18
41,141,Ершов,Митрофан,250,5,Пятигорск,2001-05-28,22
42,146,Русаков,Давид,250,2,Байкальск,1998-08-07,47
43,149,Вячеслав,Пахомов,250,3,Игарка,1997-05-14,14
44,200,Баранов,Александр,220,2,Москва,2001-08-18,44
45,201,Архипов,Андрей,180,1,Орел,2000-01-28,22
46,202,Владимиров,Анатолий,200,2,Курск,2003-05-21,14
47,203,Петрова,Екатерина,250,4,Белгород,2001-05-21,14
48,204,Петров,Вадим,250,2,Брянск,2002-05-21,44
49,205,Иванова,Мария,200,1,Липецк,2002-04-11,32
50,206,Киселев,Владимир,210,2,Орел,2003-02-10,44
51,207,Миронова,Федор,200,3,Москва,2002-04-15,45
52,276,Петров,Антон,200,4,Ульяновск,2001-08-05,22
53,654,Лукин,Артем,200,3,Воронеж,2001-12-01,10

In [42]:
# 6. Напишите запрос для получения списка студентов, получающих минимальную стипендию в своем университете, с последующей сортировкой по значениям идентификатора университета и стипендии.
# SQL -

sq = select(student_1)
sq = sq.where(student_1.c.univ_id == student_1.c.univ_id)
sub_query = select(func.min(student_2.c.stipend)).where(student_2.c.stipend > 0).scalar_subquery()

s = sq.where(student_1.c.stipend == sub_query)

print(s)
pd.read_sql(s, conn)

SELECT student_1.student_id, student_1.surname, student_1.name, student_1.stipend, student_1.kurs, student_1.city, student_1.birthday, student_1.univ_id
FROM student AS student_1
WHERE student_1.univ_id = student_1.univ_id AND student_1.stipend = (SELECT min(student_2.stipend) AS min_1
FROM student AS student_2
WHERE student_2.stipend > :stipend_1)

,student_id,surname,name,stipend,kurs,city,birthday,univ_id
0,57,Кудряшова,Вера,100,5,Нижневартовск,2002-02-18,14
1,61,Соколова,Ия,100,1,Колпашево,2002-06-25,18
2,63,Пак,Ирина,100,1,Магадан,2000-08-22,15
3,65,Сергеева,Фёкла,100,5,None,2000-02-19,10
4,73,Одинцова,Лидия,100,5,Верхний Баскунчак,2002-03-07,44
5,75,Игнатова,Зинаида,100,5,Ростов,2000-09-26,22
6,76,Мельникова,Дарья,100,5,Архангельск,2002-08-01,10
7,80,Фролова,Василиса,100,3,Кисловодск,1999-06-02,44
8,105,Антонов,Анатолий,100,1,Сыктывкар,1997-04-08,22
9,116,Федоров,Гостомысл,100,4,Новый Уренгой,2000-11-16,10
10,117,Лазарев,Константин,100,2,Славянск-на-Кубани,1998-05-22,47
11,128,Васильев,Матвей,100,1,Чебоксары,2000-07-18,46
12,143,Бирюков,Мартин,100,4,Курганинск,2000-11-14,47
13,147,Симонов,Семен,100,5,Беломорск,2000-03-17,22

In [48]:
# 7. Напишите запрос для получения списка университетов, в которых учится более 50 студентов, с последующей сортировкой по рейтингам.

sq = select(university)

sub_query = select(func.count(student.c.student_id))
sub_query = sub_query.where(university.c.univ_id == student.c.univ_id).scalar_subquery()

s = sq.where(7 < sub_query)



print(s)
pd.read_sql(s, conn)

SELECT university.univ_id, university.univ_name, university.rating, university.city
FROM university
WHERE (SELECT count(student.student_id) AS count_1
FROM student
WHERE university.univ_id = student.univ_id) > :param_1

   univ_id        univ_name  rating             city
0       10              ВГУ     296          Воронеж
1       14              БГУ     326         Белгород
2       22              МГУ     606           Москва
3       44             ФинУ     330           Москва
4       46  ФГБОУ "Политех"     304  Санкт-Петербург

In [50]:
#8 Напишите запрос для получения списка университетов, в которых работает более 5 преподавателей, с последующей сортировкой по рейтингам университетов.

lecturer_1 = lecturer.alias("lecturer_1")
university_1 = university.alias("university_1")

sq = select(func.count(lecturer.c.lecturer_id))
sq = sq.where(lecturer.c.univ_id == university.c.univ_id).scalar_subquery()

s = select(university)
s = s.where(5 < sq)
s = s.order_by(university.c.rating)

print(s)
pd.read_sql(s, conn)

SELECT university.univ_id, university.univ_name, university.rating, university.city
FROM university
WHERE (SELECT count(lecturer.lecturer_id) AS count_1
FROM lecturer
WHERE lecturer.univ_id = university.univ_id) > :param_1 ORDER BY university.rating

   univ_id univ_name  rating     city
0       10       ВГУ     296  Воронеж

In [56]:
# 9. Напишите запрос для получения списка отличников (студентов, получивших только отличные оценки), с последующей сортировкой по идентификаторам университетов и курсам.

sq = select(func.avg(exam_marks.c.mark))

sub_query = sq.where(exam_marks.c.student_id == student.c.student_id).scalar_subquery()

s = select(student)
s = s.where(sub_query == 5)

print(s)
pd.read_sql(s, conn)

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE (SELECT avg(exam_marks.mark) AS avg_1
FROM exam_marks
WHERE exam_marks.student_id = student.student_id) = :param_1

,student_id,surname,name,stipend,kurs,city,birthday,univ_id
0,10,Кузнецов,Борис,0,2,Брянск,2001-12-08,10
1,55,Белкин,Вадим,250,5,Воронеж,2000-01-07,10
2,82,Лапина,Элеонора,150,3,Джубга,1997-11-23,45
3,88,Жданова,Ирина,200,3,Тверь,2002-03-02,10
4,91,Блохина,Ираида,250,3,Новый Уренгой,1997-03-23,22
5,92,Мельникова,Светлана,250,4,Кропоткин (Краснод.),1998-03-24,15
6,99,Борисова,Марина,150,1,Рославль,1995-08-07,10

In [62]:
# 10. Напишите запрос для получения списка неуспевающих студентов (получивших хотя бы одну неудовлетворительную оценку), с последующей сортировкой по идентификаторам университетов и курсам.

sq = select(func.min(exam_marks.c.mark))

sub_query = sq.where(exam_marks.c.student_id == student.c.student_id).scalar_subquery()

s = select(student)
s = s.where(sub_query < 3)

print(s)
pd.read_sql(s, conn)

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE (SELECT min(exam_marks.mark) AS min_1
FROM exam_marks
WHERE exam_marks.student_id = student.student_id) < :param_1

,student_id,surname,name,stipend,kurs,city,birthday,univ_id
0,1,Иванов,Иван,150,1,Орел,2002-12-03,10
1,12,Зайцева,Ольга,250,2,Липецк,2001-05-01,10
2,15,Ордуханян,Рафаэль,120,1,Липецк,2003-06-01,18
3,65,Сергеева,Фёкла,100,5,None,2000-02-19,10
4,73,Одинцова,Лидия,100,5,Верхний Баскунчак,2002-03-07,44
5,76,Мельникова,Дарья,100,5,Архангельск,2002-08-01,10
6,77,Мишина,Светлана,150,2,Рыльск,1997-05-22,18
7,79,Афанасьева,Анжелика,0,2,Уфа,1996-11-22,32
8,83,Сорокина,Ирина,200,3,Усмань,1993-09-28,48
9,85,Казакова,Мария,150,4,Нальчик,1994-02-18,32
10,97,Вишнякова,Анжела,200,2,Иваново,2002-02-10,46
11,101,Калашников,Евгений,200,2,Калининград,1998-02-27,48
12,103,Трофимов,Владислав,250,5,Верхоянск,1995-03-24,11
13,110,Суханов,Константин,250,3,Курск,1996-11-22,14
14,116,Федоров,Гостомысл,100,4,Новый Уренгой,2000-11-16,10
15,123,Веселов,Тимур,150,1,Невинномысск,1998-04-28,11
16,126,Жуков,Пров,0,3,Кыштым,1998-09-11,11
17,149,Вячеслав,Пахомов,250,3,Игарка,1997-05-14,14

In [65]:
# 10. С помощью EXISTS Напишите запрос для получения списка неуспевающих студентов (получивших хотя бы одну неудовлетворительную оценку), с последующей сортировкой по идентификаторам университетов и курсам.

sq = exists(exam_marks.c.exam_id).where(exam_marks.c.mark < 3)
sq = sq.where(student.c.student_id == exam_marks.c.student_id)

s = select(student)
s = s.where(sq)

print(s)
pd.read_sql(s, conn)

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE EXISTS (SELECT exam_marks.exam_id
FROM exam_marks
WHERE exam_marks.mark < :mark_1 AND student.student_id = exam_marks.student_id)

,student_id,surname,name,stipend,kurs,city,birthday,univ_id
0,1,Иванов,Иван,150,1,Орел,2002-12-03,10
1,12,Зайцева,Ольга,250,2,Липецк,2001-05-01,10
2,15,Ордуханян,Рафаэль,120,1,Липецк,2003-06-01,18
3,65,Сергеева,Фёкла,100,5,None,2000-02-19,10
4,73,Одинцова,Лидия,100,5,Верхний Баскунчак,2002-03-07,44
5,76,Мельникова,Дарья,100,5,Архангельск,2002-08-01,10
6,77,Мишина,Светлана,150,2,Рыльск,1997-05-22,18
7,79,Афанасьева,Анжелика,0,2,Уфа,1996-11-22,32
8,83,Сорокина,Ирина,200,3,Усмань,1993-09-28,48
9,85,Казакова,Мария,150,4,Нальчик,1994-02-18,32
10,97,Вишнякова,Анжела,200,2,Иваново,2002-02-10,46
11,101,Калашников,Евгений,200,2,Калининград,1998-02-27,48
12,103,Трофимов,Владислав,250,5,Верхоянск,1995-03-24,11
13,110,Суханов,Константин,250,3,Курск,1996-11-22,14
14,116,Федоров,Гостомысл,100,4,Новый Уренгой,2000-11-16,10
15,123,Веселов,Тимур,150,1,Невинномысск,1998-04-28,11
16,126,Жуков,Пров,0,3,Кыштым,1998-09-11,11
17,149,Вячеслав,Пахомов,250,3,Игарка,1997-05-14,14

# Домашнее задание 3 (5 заданий в отдельном файле)

In [2]:
import pandas as pd
from sqlalchemy import MetaData, Table, create_engine, select, and_, or_, not_, exists
from sqlalchemy.sql import func

engine = create_engine('sqlite:///../Data/Students.db')
metadata_obj = MetaData() # Объект-контейнер, содержит информацию о схеме данных
metadata_obj.reflect(bind=engine) # Отображение БД
# Вызов метода reflect() приводит к включению в объект metadata_obj словаря всех таблиц БД.
conn=engine.connect() # Соединение

exam_marks=Table("exam_marks", metadata_obj, autoload=True, autoload_with="engine")
lecturer=Table("lecturer", metadata_obj, autoload=True, autoload_with="engine")
student=Table("student", metadata_obj, autoload=True, autoload_with="engine")
subj_lect=Table("subj_lect", metadata_obj, autoload=True, autoload_with="engine")
subject=Table("subject", metadata_obj, autoload=True, autoload_with="engine")
university=Table("university", metadata_obj, autolad=True, autolad_with="engine")

In [4]:
#1. Напишите запрос с EXISTS, позволяющий вывести данные обо всех студентах обучающихся в вузах, имеющих рейтинг выше 300.
# SQL - SELECT * FROM student WHERE univ_id IN (SELECT univ_id FROM university WHERE rating > 300)

s = exists(university).where(university.c.rating > 300)

sq = s.where(student.c.univ_id == university.c.univ_id)

s = select(student)

s = s.where(sq)

print(s)
pd.read_sql(s, conn)

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE EXISTS (SELECT university.univ_id
FROM university
WHERE university.rating > :rating_1 AND student.univ_id = university.univ_id)

,student_id,surname,name,stipend,kurs,city,birthday,univ_id
0,6,Сидоров,Вадим,150,4,Москва,1999-06-07,22
1,15,Ордуханян,Рафаэль,120,1,Липецк,2003-06-01,18
2,32,Котов,Павел,150,5,Белгород,2001-02-28,14
3,57,Кудряшова,Вера,100,5,Нижневартовск,2002-02-18,14
4,58,Журавлева,Вера,0,4,Новосибирск,2003-06-14,11
...,...,...,...,...,...,...,...,...
58,204,Петров,Вадим,250,2,Брянск,2002-05-21,44
59,205,Иванова,Мария,200,1,Липецк,2002-04-11,32
60,206,Киселев,Владимир,210,2,Орел,2003-02-10,44
61,207,Миронова,Федор,200,3,Москва,2002-04-15,45
62,276,Петров,Антон,200,4,Ульяновск,2001-08-05,22

In [8]:
# 3. Напишите запрос с EXISTS, выбирающий сведения о каждом студенте, для которого в городе его проживания имеется хотя бы один университет, в котором он не учится.

s = exists(university).where(university.c.city != student.c.city)

sq = s.where(student.c.univ_id == university.c.univ_id)

s = select(student)

s = s.where(sq)


print(s)
pd.read_sql(s, conn)

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE EXISTS (SELECT university.univ_id, university.univ_name, university.rating, university.city
FROM university
WHERE university.city != student.city AND student.univ_id = university.univ_id)

,student_id,surname,name,stipend,kurs,city,birthday,univ_id
0,1,Иванов,Иван,150,1,Орел,2002-12-03,10
1,3,Петров,Петр,200,3,Курск,2000-12-01,10
2,10,Кузнецов,Борис,0,2,Брянск,2001-12-08,10
3,12,Зайцева,Ольга,250,2,Липецк,2001-05-01,10
4,15,Ордуханян,Рафаэль,120,1,Липецк,2003-06-01,18
...,...,...,...,...,...,...,...,...
74,202,Владимиров,Анатолий,200,2,Курск,2003-05-21,14
75,204,Петров,Вадим,250,2,Брянск,2002-05-21,44
76,205,Иванова,Мария,200,1,Липецк,2002-04-11,32
77,206,Киселев,Владимир,210,2,Орел,2003-02-10,44
78,276,Петров,Антон,200,4,Ульяновск,2001-08-05,22